In [ ]:
import prettytable
prettytable.DEFAULT_STYLE = prettytable.PLAIN_COLUMNS

In [2]:
%load_ext sql

import prettytable
prettytable.DEFAULT_STYLE = prettytable.PLAIN_COLUMNS

%sql mysql+pymysql://root:Revathi12%40@localhost/employees #%40 is used for @

0 rows affected.

[]

# SQL Interview Concepts with Sample Questions and Answers

### 1. Window Functions
**Q1. Find the top 3 highest paid employees in each department (current salaries).**

In [15]:
%%sql
WITH ranked_salaries AS (
    SELECT 
        d.dept_no,
        e.emp_no,
        e.first_name,
        e.last_name,
        s.salary,
        RANK() OVER (PARTITION BY d.dept_no ORDER BY s.salary DESC) AS rnk
    FROM employees e
    JOIN salaries s ON e.emp_no = s.emp_no AND s.to_date = '9999-01-01'
    JOIN dept_emp d ON e.emp_no = d.emp_no AND d.to_date = '9999-01-01'
)
SELECT *
FROM ranked_salaries
WHERE rnk <= 3
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[('d001', 466852, 'Akemi', 'Warwick', 145128, 1),
 ('d001', 89825, 'Ingmar', 'Isard', 143644, 2),
 ('d001', 107140, 'Ortrud', 'Diderrich', 142506, 3),
 ('d002', 413137, 'Lunjin', 'Swick', 142395, 1),
 ('d002', 237069, 'Uta', 'Lowrie', 140742, 2),
 ('d002', 274371, 'Genki', 'Delaune', 138775, 3),
 ('d003', 421835, 'Yinlin', 'Flowers', 141953, 1),
 ('d003', 216867, 'Kannan', 'Emiris', 128308, 2),
 ('d003', 280612, 'Yifei', 'Gien', 125263, 3),
 ('d004', 430504, 'Youjian', 'Cronau', 138273, 1)]

### 2. Aggregations & Grouping
**Q2. Get average salary by department (current employees only).**

In [16]:
%%sql
SELECT d.dept_no, AVG(s.salary) AS avg_salary
FROM salaries s
JOIN dept_emp d ON s.emp_no = d.emp_no
WHERE s.to_date = '9999-01-01' AND d.to_date = '9999-01-01'
GROUP BY d.dept_no
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
9 rows affected.

[('d005', Decimal('67657.9196')),
 ('d007', Decimal('88852.9695')),
 ('d004', Decimal('67843.3020')),
 ('d003', Decimal('63921.8998')),
 ('d008', Decimal('67913.3750')),
 ('d006', Decimal('65441.9934')),
 ('d001', Decimal('80058.8488')),
 ('d009', Decimal('67285.2302')),
 ('d002', Decimal('78559.9370'))]

### 3. Subqueries & CTEs (Common Table Expressions)
**Q3. Find employees who earn more than the average salary.**

In [17]:
%%sql
SELECT e.emp_no, e.first_name, e.last_name, s.salary
FROM employees e
JOIN salaries s ON e.emp_no = s.emp_no
WHERE s.to_date = '9999-01-01'
AND s.salary > (
    SELECT AVG(salary) FROM salaries WHERE to_date = '9999-01-01'
)
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10001, 'Georgi', 'Facello', 88958),
 (10002, 'Bezalel', 'Simmel', 72527),
 (10004, 'Chirstian', 'Koblick', 74057),
 (10005, 'Kyoichi', 'Maliniak', 94692),
 (10007, 'Tzvetan', 'Zielinski', 88070),
 (10009, 'Sumant', 'Peac', 94409),
 (10010, 'Duangkaew', 'Piveteau', 80324),
 (10016, 'Kazuhito', 'Cappelletti', 77935),
 (10017, 'Cristinel', 'Bouloucos', 99651),
 (10018, 'Kazuhide', 'Peha', 84672)]

### 4. Filtering & Edge Cases
**Q4. Find employees with no department currently assigned.**

In [18]:
%%sql
SELECT e.emp_no, e.first_name, e.last_name
FROM employees e
LEFT JOIN dept_emp d ON e.emp_no = d.emp_no AND d.to_date = '9999-01-01'
WHERE d.emp_no IS NULL
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10008, 'Saniya', 'Kalloufi'),
 (10011, 'Mary', 'Sluis'),
 (10015, 'Guoxiang', 'Nooteboom'),
 (10021, 'Ramzi', 'Erde'),
 (10025, 'Prasadram', 'Heyers'),
 (10028, 'Domenick', 'Tempesti'),
 (10033, 'Arif', 'Merlo'),
 (10034, 'Bader', 'Swan'),
 (10042, 'Magy', 'Stamatiou'),
 (10048, 'Florian', 'Syrotiuk')]

### 5. Join Mastery
**Q5. List employees along with their manager names.**

In [19]:
%%sql
SELECT 
    e.emp_no AS employee_id,
    e.first_name AS employee_name,
    m.emp_no AS manager_id,
    m.first_name AS manager_name
FROM dept_emp d
JOIN dept_manager dm ON d.dept_no = dm.dept_no
JOIN employees e ON e.emp_no = d.emp_no
JOIN employees m ON m.emp_no = dm.emp_no
WHERE d.to_date = '9999-01-01' AND dm.to_date = '9999-01-01'
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10017, 'Cristinel', 110039, 'Vishwani'),
 (10058, 'Berhard', 110039, 'Vishwani'),
 (10140, 'Yucel', 110039, 'Vishwani'),
 (10228, 'Karoline', 110039, 'Vishwani'),
 (10239, 'Nikolaos', 110039, 'Vishwani'),
 (10340, 'Djelloul', 110039, 'Vishwani'),
 (10353, 'Phule', 110039, 'Vishwani'),
 (10367, 'Hyuckchul', 110039, 'Vishwani'),
 (10384, 'Feiyu', 110039, 'Vishwani'),
 (10418, 'Candida', 110039, 'Vishwani')]

### 6. Advanced Queries
**Q6. Find employees who had multiple job titles over time.**

In [20]:
%%sql
SELECT emp_no, COUNT(DISTINCT title) AS title_count
FROM titles
GROUP BY emp_no
HAVING COUNT(DISTINCT title) > 1
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10004, 2),
 (10005, 2),
 (10007, 2),
 (10009, 3),
 (10012, 2),
 (10017, 2),
 (10018, 2),
 (10026, 2),
 (10027, 2),
 (10029, 2)]

### 7. Cohort Analysis (Data Science Focus)
**Q7. Get the number of employees hired each year.**

In [21]:
%%sql
SELECT YEAR(hire_date) AS hire_year, COUNT(*) AS total_hired
FROM employees
GROUP BY YEAR(hire_date)
ORDER BY hire_year
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(1985, 35316),
 (1986, 36150),
 (1987, 33501),
 (1988, 31436),
 (1989, 28394),
 (1990, 25610),
 (1991, 22568),
 (1992, 20402),
 (1993, 17772),
 (1994, 14835)]

### 8. Funnel Logic
**Q8. Identify employees who changed departments at least once.**

In [22]:
%%sql
SELECT emp_no, COUNT(DISTINCT dept_no) AS dept_count
FROM dept_emp
GROUP BY emp_no
HAVING COUNT(DISTINCT dept_no) > 1
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10010, 2),
 (10018, 2),
 (10029, 2),
 (10040, 2),
 (10050, 2),
 (10060, 2),
 (10070, 2),
 (10080, 2),
 (10088, 2),
 (10098, 2)]

### 9. First Event Detection
**Q9. Get the first job title of each employee.**

In [23]:
%%sql
SELECT emp_no, title
FROM (
    SELECT *, ROW_NUMBER() OVER (PARTITION BY emp_no ORDER BY from_date) AS rnk
    FROM titles
) t
WHERE rnk = 1
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10001, 'Senior Engineer'),
 (10002, 'Staff'),
 (10003, 'Senior Engineer'),
 (10004, 'Engineer'),
 (10005, 'Staff'),
 (10006, 'Senior Engineer'),
 (10007, 'Staff'),
 (10008, 'Assistant Engineer'),
 (10009, 'Assistant Engineer'),
 (10010, 'Engineer')]

### 10. Salary Drop Detection (Real-World Check)
**Q10. Find employees whose current salary is less than their previous one.**

In [24]:
%%sql
WITH salary_ranked AS (
    SELECT *,
        ROW_NUMBER() OVER (PARTITION BY emp_no ORDER BY from_date DESC) AS rnk
    FROM salaries
)
SELECT s1.emp_no, s1.salary AS current_salary, s2.salary AS previous_salary
FROM salary_ranked s1
JOIN salary_ranked s2 ON s1.emp_no = s2.emp_no AND s1.rnk = 1 AND s2.rnk = 2
WHERE s1.salary < s2.salary
LIMIT 10;

 * mysql+pymysql://root:***@localhost/employees
10 rows affected.

[(10003, 43311, 43699),
 (10006, 59755, 60098),
 (10009, 94409, 94443),
 (10012, 54423, 54794),
 (10023, 50113, 50319),
 (10037, 60574, 60992),
 (10042, 94868, 95035),
 (10045, 47581, 47984),
 (10048, 39507, 40000),
 (10062, 68559, 68784)]